modules/gateway/server/src/test/resources/com/l7tech/server/policy/resources/REQUEST_wss_x509_and_SAML.xml

<!--
  Message body signed with both an X.509 token (Alice) and SAML token (Bob)
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://warehouse.acme.com/ws">
   <soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><saml1:Assertion AssertionID="_5996832A6B052193F51523298910426636" IssueInstant="2018-04-09T18:35:10.399Z" Issuer="Bob" MajorVersion="1" MinorVersion="1" xsi:type="saml1:AssertionType" xmlns:saml1="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><saml1:Conditions NotBefore="2018-04-09T18:35:10.439Z" NotOnOrAfter="2018-04-09T18:40:10.439Z"/><saml1:AuthenticationStatement AuthenticationInstant="2018-04-09T18:35:10.438Z" AuthenticationMethod="urn:oasis:names:tc:SAML:1.0:am:password" xsi:type="saml1:AuthenticationStatementType"><saml1:Subject><saml1:NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified">CN=Bob, OU=OASIS Interop Test Cert, O=OASIS</saml1:NameIdentifier><saml1:SubjectConfirmation><saml1:ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:holder-of-key</saml1:ConfirmationMethod><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:X509Data><ds:X509Certificate>MIICgDCCAWigAwIBAgIJALLt3UmjdE/SMA0GCSqGSIb3DQEBBQUAMDAxDjAMBgNVBAoTBU9BU0lT
MR4wHAYDVQQDExVPQVNJUyBJbnRlcm9wIFRlc3QgQ0EwIBcNMTgwMzI2MjE1MzE2WhgPMjExODAz
MDIyMTUzMTZaMEAxDjAMBgNVBAoTBU9BU0lTMSAwHgYDVQQLExdPQVNJUyBJbnRlcm9wIFRlc3Qg
Q2VydDEMMAoGA1UEAxMDQm9iMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQClABVkHkpmzwTE
jeln58wz3S8pUNLjrmpIUZxKxgVQBQFqHrniLLpY27ZYq3G/C3f2/InHSz6ikIn3OyA5qm7o1GpW
EYiBlZWT4OAWCSEjCOD74y2WqvPqJvkr2s/57ILoSR6rFgZudI95UIuNasWYap4TlV/llM2tDP+n
QkTCjQIDAQABow8wDTALBgNVHQ8EBAMCBLAwDQYJKoZIhvcNAQEFBQADggEBAFUxuFvYk75cC1y9
0JTXFKt0sIkiUWvuTcUOsFOfHh93rzDC/im9NuQZ7izEjrENARbx6mYBZq4Qf/LYfgLySm2KPLg2
X80yr9vnlBU4GiircdK9Rf6hy1cCSe1hz2Z2Gh45bo0fGgX8vLhXJ6c2lWo/LeR5H+PWhBSLBQm8
7TxlahFrUfM43cl33v4wmV5J+TYDrvp+90Cb3FrQWYfBfdVvCjyat9rlzUb0dc3oyMIheFUWuqid
NNV16HMhE5gEg4eaLlgvLjLGTUf2cPyeS+b+6cuhzzjwZedfSszlENSRMPXzrXZm/2ZYM/xDyTA3
HUFY09XXtTrXgeOyBUpVlmA=</ds:X509Certificate></ds:X509Data></ds:KeyInfo></saml1:SubjectConfirmation></saml1:Subject></saml1:AuthenticationStatement><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#_5996832A6B052193F51523298910426636"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>hUJ8eHxJntzCxmzoPNf6gN9JVf8=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>YS+HNh70uM634mibaYypYNPSMP3+mpyy10pUEfxAEla6ybFx94HqS9SeD5/a+2n5ag9mfgSV0wV+eA+G3ta+aN+/HXPWp3bQFU8FCAjIVbOWcXcdv//juHARWw4WcGYemWEc/7LO+/fpMvmSFt56iiT/yOitXCYuHuQ/PoVGRfM=</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIICgDCCAWigAwIBAgIJALLt3UmjdE/SMA0GCSqGSIb3DQEBBQUAMDAxDjAMBgNVBAoTBU9BU0lT
MR4wHAYDVQQDExVPQVNJUyBJbnRlcm9wIFRlc3QgQ0EwIBcNMTgwMzI2MjE1MzE2WhgPMjExODAz
MDIyMTUzMTZaMEAxDjAMBgNVBAoTBU9BU0lTMSAwHgYDVQQLExdPQVNJUyBJbnRlcm9wIFRlc3Qg
Q2VydDEMMAoGA1UEAxMDQm9iMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQClABVkHkpmzwTE
jeln58wz3S8pUNLjrmpIUZxKxgVQBQFqHrniLLpY27ZYq3G/C3f2/InHSz6ikIn3OyA5qm7o1GpW
EYiBlZWT4OAWCSEjCOD74y2WqvPqJvkr2s/57ILoSR6rFgZudI95UIuNasWYap4TlV/llM2tDP+n
QkTCjQIDAQABow8wDTALBgNVHQ8EBAMCBLAwDQYJKoZIhvcNAQEFBQADggEBAFUxuFvYk75cC1y9
0JTXFKt0sIkiUWvuTcUOsFOfHh93rzDC/im9NuQZ7izEjrENARbx6mYBZq4Qf/LYfgLySm2KPLg2
X80yr9vnlBU4GiircdK9Rf6hy1cCSe1hz2Z2Gh45bo0fGgX8vLhXJ6c2lWo/LeR5H+PWhBSLBQm8
7TxlahFrUfM43cl33v4wmV5J+TYDrvp+90Cb3FrQWYfBfdVvCjyat9rlzUb0dc3oyMIheFUWuqid
NNV16HMhE5gEg4eaLlgvLjLGTUf2cPyeS+b+6cuhzzjwZedfSszlENSRMPXzrXZm/2ZYM/xDyTA3
HUFY09XXtTrXgeOyBUpVlmA=</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature></saml1:Assertion><ds:Signature Id="SIG-5996832A6B052193F51523298910478640" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-5996832A6B052193F51523298909566634"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>M3fuj5/X/lkhmgUFHy2JBxt8KcE=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>bfC8n17zKoHv3RmJWLUdDBsKiqEhyznvHP/eWor3FBzp26LlRnQxb9bH+Icfp5cmPWDnspui7mAo
wEVQjWnIzGwhVxxUd12iw5umyoRq6P/TMfPQRXcJ3+4Mrgb6ORQ62p7/xzj6X7LddkmpHZjx/Iar
IN4PGVRaYdkg0rRuQdY=</ds:SignatureValue><ds:KeyInfo Id="KeyId-5996832A6B052193F51523298910478637"><wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV1.1" wsu:Id="STRId-5996832A6B052193F51523298910478638" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"><wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.0#SAMLAssertionID">_5996832A6B052193F51523298910426636</wsse:KeyIdentifier></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-5996832A6B052193F51523298909566631">MIICgjCCAWqgAwIBAgIJALLt3UmjdE/TMA0GCSqGSIb3DQEBBQUAMDAxDjAMBgNVBAoTBU9BU0lTMR4wHAYDVQQDExVPQVNJUyBJbnRlcm9wIFRlc3QgQ0EwIBcNMTgwMzI2MjMxNjIxWhgPMjExODAzMDIyMzE2MjFaMEIxDjAMBgNVBAoTBU9BU0lTMSAwHgYDVQQLExdPQVNJUyBJbnRlcm9wIFRlc3QgQ2VydDEOMAwGA1UEAxMFQWxpY2UwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBAIUJPCtG7JthGRmQ8G1iryHRwCaU7aBRNqPl5dakkUsyoZLQ/ZBp7pOor6PnP/8l2FwF39bT8cR2lo2CqQqZ2UE7lCVq0Iz210U8Z1I7BcZw/ucEFhYE3NBsrXmI1eMTe9hwdvqvCmN48SWK1T4LaeYNN+P+QUSnkSEm8MvFQMiPAgMBAAGjDzANMAsGA1UdDwQEAwIEsDANBgkqhkiG9w0BAQUFAAOCAQEAFFJdESl83b5ChMRW6xfJJsfvG+Hdi55Ppgz98gKgoYMewX4dGAbaELLxeGH1iWvtuvUjxW4jEBkoV5iVtKDVwwJElt/mOFTnTguhdd/OJYDnNtVQd+URvk6QnG8tAvoKQxqsp6DSrs81W/pWVXMXe3xektcfq+NlGl1ylbmsj+oFd+XfiZbKKfE9YU4Q9oGs48T70a4uvIRhyaswZlO1vu+QNHHss40mwrhZV9s1QEOV8+l1EiyornIOQLVX/mQoBY+2wh5I5G7IzZp6oWA+L578D5KI84Yh4xXKR5+1r4P1+yCDNxIO6J+Iyizb5cEEcaS25Qw6GMUuVd/KKYqUWw==</wsse:BinarySecurityToken><ds:Signature Id="SIG-5996832A6B052193F51523298909567635" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-5996832A6B052193F51523298909566634"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>M3fuj5/X/lkhmgUFHy2JBxt8KcE=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>g+HwLEaopUODuXPmLypULyCtwRprwT+kkXxMkUAEgVcxA2Y1bejb6FATxku9uWrxjqt5gvESMoIT
uvAQJVz3L+nbOOSbt/xUKffcWcSwojZ9w89xTZUP6klmoRiqcEnVLs6/qaul6KxKkEevcmOAXYQ9
6RKgg9XpJAqcFpIta4c=</ds:SignatureValue><ds:KeyInfo Id="KI-5996832A6B052193F51523298909566632"><wsse:SecurityTokenReference wsu:Id="STR-5996832A6B052193F51523298909566633"><wsse:Reference URI="#X509-5996832A6B052193F51523298909566631" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header>
   <soapenv:Body wsu:Id="id-5996832A6B052193F51523298909566634" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <ws:listProducts>
         <ws:delay>0</ws:delay>
      </ws:listProducts>
   </soapenv:Body>
</soapenv:Envelope>